# Создать телефонный справочник с возможностью импорта и экспорта данных в формате .csv. Фамилия, имя, отчество и номер телефона - 
# данные, которые должны находиться в двух файлах, разных форматов записи.
# 1. Программа должна выводить записи.
# 2. Программа должна сохранять данные.
# 3. Использование функций. Ваша программа не должна быть линейной.

# Домашнее задание: Дополнить телефонный справочник возможностью изменения и удаления данных (и изменять, и удалять в двух файлах). 



# data_first_variant.csv - файл содержит данные, разбитые на блоки по несколько строк
# data_second_variant.csv - файл содержит данные, записанные в строку
# ui.py - файл, где мы встречаемся с пользователем, общаемся и рассказываем, что может делать наш Бот
# logger.py - в этом файле хранятся 2 функции - для сохранения данных и для выведения данных
# data_create.py - файл для хранения функций для заполнения базы данных
# main.py - для запуска функции interface файла ui.py